docs/factorial.md
```dot
digraph G {
  bgcolor="transparent";
  node [shape="box", style="filled", fontname="Ubuntu Mono"];
  "139838052484336" [label="form", shape="box", fillcolor="lightpink"];
  "139838052484416" [label="part: def", shape="box", fillcolor="#FFD8E1"];
  "139838052484336" -> "139838052484416";
  "139838052484496" [label="apply", shape="box", fillcolor="lightgreen"];
  "139838052484416" -> "139838052484496";
  "139838052484576" [label="identifier: f", shape="box", fillcolor="Honeydew"];
  "139838052484496" -> "139838052484576";
  "139838052484656" [label="arguments", shape="box", fillcolor="PaleTurquoise"];
  "139838052484496" -> "139838052484656";
  "139838052484736" [label="identifier: n", shape="box", fillcolor="Honeydew"];
  "139838052484656" -> "139838052484736";
  "139838052484816" [label="part: _", shape="box", fillcolor="#FFD8E1"];
  "139838052484336" -> "139838052484816";
  "139838052484896" [label="form", shape="box", fillcolor="lightpink"];
  "139838052484816" -> "139838052484896";
  "139838052484976" [label="part: if", shape="box", fillcolor="#FFD8E1"];
  "139838052484896" -> "139838052484976";
  "139838052485056" [label="operator: <=", shape="box", fillcolor="#C0FFC0"];
  "139838052484976" -> "139838052485056";
  "139838052485136" [label="identifier: n", shape="box", fillcolor="Honeydew"];
  "139838052485056" -> "139838052485136";
  "139838052485216" [label="number: 1", shape="box", fillcolor="lightgoldenrodyellow"];
  "139838052485056" -> "139838052485216";
  "139838052485296" [label="part: _", shape="box", fillcolor="#FFD8E1"];
  "139838052484896" -> "139838052485296";
  "139838052485376" [label="number: 1", shape="box", fillcolor="lightgoldenrodyellow"];
  "139838052485296" -> "139838052485376";
  "139838052485456" [label="part: else", shape="box", fillcolor="#FFD8E1"];
  "139838052484896" -> "139838052485456";
  "139838052485536" [label="operator: *", shape="box", fillcolor="#C0FFC0"];
  "139838052485456" -> "139838052485536";
  "139838052485616" [label="identifier: n", shape="box", fillcolor="Honeydew"];
  "139838052485536" -> "139838052485616";
  "139838052485696" [label="apply", shape="box", fillcolor="lightgreen"];
  "139838052485536" -> "139838052485696";
  "139838052485856" [label="identifier: f", shape="box", fillcolor="Honeydew"];
  "139838052485696" -> "139838052485856";
  "139838052486016" [label="arguments", shape="box", fillcolor="PaleTurquoise"];
  "139838052485696" -> "139838052486016";
  "139838052486176" [label="operator: -", shape="box", fillcolor="#C0FFC0"];
  "139838052486016" -> "139838052486176";
  "139838052486336" [label="identifier: n", shape="box", fillcolor="Honeydew"];
  "139838052486176" -> "139838052486336";
  "139838052486496" [label="number: 1", shape="box", fillcolor="lightgoldenrodyellow"];
  "139838052486176" -> "139838052486496";
}
```
